In [1]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

In [4]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
inputs.drop('Sex',axis='columns',inplace=True)

In [8]:
inputs

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [9]:
# to check is any column contains NaN
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
# so age column has some NaN values
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
# fill the Nan values with the mean of the Age column
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [12]:
inputs.columns[inputs.isna().any()]
# so no NaN values now!

Index([], dtype='object')

In [13]:
# split the train and test data
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [14]:
len(X_train)

712

In [15]:
len(X_test)

179

In [16]:
len(inputs)

891

In [17]:
X_train.head()

     Pclass   Age      Fare  female  male
393       1  23.0  113.2750       1     0
630       1  80.0   30.0000       0     1
22        3  15.0    8.0292       1     0
424       3  18.0   20.2125       0     1
397       2  46.0   26.0000       0     1

In [18]:
# using Naive based classifier
# using Gaussian Naive Based classfier when the distribution is not Normal i.e it is Gaussian
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [19]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [20]:
model.score(X_test,y_test)

0.7821229050279329

In [21]:
X_test[:10]

     Pclass        Age     Fare  female  male
695       2  52.000000  13.5000       0     1
183       2   1.000000  39.0000       0     1
273       1  37.000000  29.7000       0     1
7         3   2.000000  21.0750       0     1
250       3  29.699118   7.2500       0     1
396       3  31.000000   7.8542       1     0
265       2  36.000000  10.5000       0     1
204       3  18.000000   8.0500       0     1
351       1  29.699118  35.0000       0     1
348       3   3.000000  15.9000       0     1

In [22]:
y_test[:10]

695    0
183    1
273    0
7      0
250    0
396    0
265    0
204    1
351    0
348    1
Name: Survived, dtype: int64

In [23]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [24]:
model.predict_proba(X_test[:10])
# didn't survive, survived

array([[0.97678892, 0.02321108],
       [0.94963188, 0.05036812],
       [0.92515886, 0.07484114],
       [0.98305635, 0.01694365],
       [0.99149819, 0.00850181],
       [0.09827701, 0.90172299],
       [0.98063081, 0.01936919],
       [0.98993006, 0.01006994],
       [0.91884813, 0.08115187],
       [0.98395488, 0.01604512]])